Repository: cinek01/pwizaliczenie
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pl

source: About the faculty
pl: O Wydziale

source: About direction
pl: O Kierunku

source: Contact
pl: Kontakt

source: The Faculty of Applied Informatics and Mathematics was established on January 1, 2008 on the basis of the Interfaculty Study of Computer Science and Econometrics (later called: Interfaculty Study of Computer Science Applications). The study was established by the Senate of the Warsaw University of Life Sciences (SGGW) on 24 January 2001. The aim of the study was to educate students in computer science and econometrics using the SGGW didactic base. The classes were conducted mainly by SGGW scientific staff dealing with mathematics and IT, employed in various University organizational units.
pl: Wydział Zastosowań Informatyki i Matematyki powstał 1 stycznia 2008 roku na bazie Międzywydziałowego Studium Informatyki i Ekonometrii (późniejsza nazwa: Międzywydziałowe Studium Zastosowań Informatyki). Studium powołane zostało przez Senat Szkoły Głównej Gospodarstwa Wiejskiego w Warszawie w dniu 24 stycznia 2001 roku. Celem Studium było kształcenie studentów w zakresie informatyki i ekonometrii z wykorzystaniem bazy dydaktycznej SGGW. Zajęcia prowadzone były w większości przez pracowników naukowych SGGW zajmujących się problematyką matematyczno-informatyczną, zatrudnionych w różnych jednostkach organizacyjnych Uczelni.

source: Read more.
pl: Czytaj więcej.

source: Informatics
pl: Informatyka

source: Studying computer science at SGGW, you will learn, among others, about:
pl: Studiując informatykę na SGGW, dowiesz się między innymi o:

source: Physical foundations of information theory
pl: Fizycznych podstawach teorii informacji

source: Information protection and cryptology
pl: Ochronie informacji i kryptologii

source: Computer networks (CISCO technologies)
pl: Sieciach komputerowych (technologie CISCO)

source: Security of computer networks and systems
pl: Bezpieczeństwie sieci i systemów komputerowych

source: Wireless communications and mobile systems
pl: Komunikacji bezprzewodowych i systemów mobilnych

source: Diagnostics of analog systems
pl: Diagnostyce systemów analogowych

source: Computer vision
pl: Wizji komputerowej

source: The program for the first semester is presented below.
pl: Poniżej przedstawiono program dla semestru pierwszego.

source: General description of the abbreviations:
pl: Opis ogólny skrótów:

source: N - number
pl: L - liczba

source: h - hours
pl: g - godzin

source: lec - lecture
pl: wyk - wykładu

source: lab - laboratory
pl: lab - laboratoryjnych

source: Description of class status symbols:
pl: Opis symboli statusu zajęć:

source: P - basic classes
pl: P - zajęcia podstawowe

source: O - obligatory classes
pl: O - zajęcia obligatoryjne

source: N - general academic profile
pl: N - profil ogólnoakademicki

source: The name of an object
pl: Nazwa Przedmiotu

source: N.h. lec.
pl: L.g. wyk.

source: N.h. exe.
pl: L.g. ćw.

source: N.h. exe. lab.
pl: L.g. ćw. lab.

source: Credit type
pl: Typ zaliczenia

source: Statuses
pl: Statusy

source: Introduction to programming
pl: Wstęp do programowania

source: Exam
pl: Egzamin

source: Basics of mathematical analysis
pl: Podstawy analizy matematycznej

source: Fundamentals of higher mathematics
pl: Podstawy matematyki wyższej

source: Discrete mathematics 1
pl: Matematyka dyskretna 1

source: Fundamentals of Physics
pl: Podstawy fizyki

source: Algorithmic reasoning
pl: Rozumowania algorytmiczne

source: Rating
pl: Ocena

source: Ergonomics and OHS
pl: Ergonomia i BHP

source: Forms of contact
pl: Formy Kontaktu

source: Telephone
pl: Telefon

source: ATTENTION!
pl: UWAGA

source: Close the warning
pl: Zamknij ostrzeżenie
